; domain
(define (domain matrix)
(:requirements :typing :fluents)

	(:types data task hosts - object)

	(:predicates
		(have ?d - data)
		(availiable ?h - hosts)
		(half-availiable ?h - hosts)
		(working-full ?h - hosts ?t - task)
		(working-half ?h - hosts ?t - task)
		(input2 ?d1 - data ?d2 - data ?t - task)
		(output1 ?d1 - data ?t - task)
	)

	(:functions
		(total-cost)
	)

	(:action start-task-full2
	:parameters (?h - hosts ?t - task ?i1 - data ?i2 - data)
	:precondition (and (availiable ?h) (have ?i1) (have ?i2) (input2 ?i1 ?i2 ?t))
	:effect (and (working-half ?h ?t) (not (availiable ?h)) (increase (total-cost) 1))
	)

	(:action start-task-half2
	:parameters (?h - hosts ?t - task ?i1 - data ?i2 - data)
	:precondition (and (half-availiable ?h) (have ?i1) (have ?i2) (input2 ?i1 ?i2 ?t))
	:effect (and (working-full ?h ?t) (not (half-availiable ?h)) (increase (total-cost) 10))
	)

	(:action end-task-full1
	:parameters (?h - hosts ?t - task ?i1 - data)
	:precondition (and (working-half ?h ?t) (output1 ?i1 ?t))
	:effect (and (availiable ?h) (have ?i1) (not (half-availiable ?h)) (not (working-half ?h ?t)))
	)

	(:action end-task-half1
	:parameters (?h - hosts ?t - task ?i1 - data)
	:precondition (and (working-full ?h ?t) (output1 ?i1 ?t))
	:effect (and (half-availiable ?h) (have ?i1) (not (working-full ?h ?t)))
	)

)

; problem
(define (problem problem_matrix)
(:domain matrix)

	(:objects
		matrix_a matrix_b matrix_c matrix_d matrix_i matrix_j matrix_out - data
		sum_ab sum_cd mult_ij - task
		h0 h1 - hosts
	)

	(:init
		(have matrix_a)
		(have matrix_b)
		(have matrix_c)
		(have matrix_d)

		(input2 matrix_a matrix_b sum_ab)
		(input2 matrix_c matrix_d sum_cd)
		(input2 matrix_i matrix_j mult_ij)

		(output1 matrix_i sum_ab)
		(output1 matrix_j sum_cd)
		(output1 matrix_out mult_ij)

		(availiable h0)
		(availiable h1)
		
		(= (total-cost) 0)
	)

	(:goal
		(have matrix_out)

	)

	(:metric minimize (total-cost))
)

; plan
1. (start-task-full2 h1 sum_cd matrix_c matrix_d)
   deleted: (availiable h1)
   added: (working-half h1 sum_cd)
   goals met: 0 of 1
2. (start-task-full2 h0 sum_ab matrix_a matrix_b)
   deleted: (availiable h0)
   added: (working-half h0 sum_ab)
   goals met: 0 of 1
3. (end-task-full1 h0 sum_ab matrix_i)
   deleted: (working-half h0 sum_ab)
   added: (availiable h0) (have matrix_i)
   goals met: 0 of 1
4. (end-task-full1 h1 sum_cd matrix_j)
   deleted: (working-half h1 sum_cd)
   added: (availiable h1) (have matrix_j)
   goals met: 0 of 1
5. (start-task-full2 h1 mult_ij matrix_i matrix_j)
   deleted: (availiable h1)
   added: (working-half h1 mult_ij)
   goals met: 0 of 1
6. (end-task-full1 h1 mult_ij matrix_out)
   deleted: (working-half h1 mult_ij)
   added: (availiable h1) (have matrix_out)
   goals met: 1 of 1
